# Intro to SQL Databases

Agenda today:
- Introducing structure and overview of relational databases 
- Different types of sql databases
- Instantiate database instance on your local computer
- Working with querying data in db

## Part I. DB Structures

### What is a Database?
- In general, databases store sets of data that can be queried for use in other applications. A database management system supports the development, administration and use of database platforms.

### What is a Relational Database? 
- An realtionsal database management system (RDBMS) is a type of DBMS with a row-based table structure that connects related data elements and includes functions that maintain the security, accuracy, integrity and consistency of the data.
- The most basic RDBMS functions are related to create, read, update and delete operations, collectively known as CRUD.

### What is SQL?

- SQL stands for Structured Query Language.
- A programming language used to communicate with data stored in a relational database management system.
- SQL syntax is similar to the English language, which makes it relatively easy to write, read, and interpret.

### POPULAR RDBMS

- SQLite
- MySQL
- PostgreSql
- Oracle DB
- SQL Server

### SQLite
- SQLite is a popular open source SQL database. 
- It can store an entire database in a single file.
- It is 'lite' because it is not server based.
- Does not have many features of server-based RDBMS like users and permissions.
- Great to get up and running quick, not good for complex projects.

### MySQL

- MySQL is the most popular open source SQL database. 
- It is typically used for web application development, and often accessed using PHP. 
- It is easy to use, inexpensive, reliable and has a large community of developers who can help answer questions.
- Open source development has lagged since Oracle has taken control of MySQL.
- Has been known to suffer from poor performance when scaling, 
- Does not include some advanced features that developers may be used to.

### PostgreSQL

- PostgreSQL is an open-source SQL database that is not controlled by any corporation.
- PostgreSQL shares many of the same advantages of MySQL.
- It is slower in performance than other databases such as MySQL
- Harder to come by hosts or service providers that offer managed PostgreSQL instances.

### Oracle DB

- Owned by Oracle Corporation, and the code is not open sourced. 
- Oracle DB is for large applications, particularly in the banking industry. 
- The main disadvantage of using Oracle is that it is not free.

## Part II. Working with Sqlite DB

First of all, everyone fill out a dictionary of the following structure:
```javascript
    {'first_name': 'Fangfang',
    'birthday':'09-07'
    }```

### Instantiating, creating, and inserting data into a database

In [1]:
## instantiate a sql instance on your local computer 
import sqlite3

# we then need to establish a connection object that represent the database
conn = sqlite3.connect('students.db')

# we then create a cursor that allow us to interact with, and create sql commands
c = conn.cursor()

In [2]:
# create a table, insert entries, and query results 
c.execute("""CREATE TABLE students (
            first_name text,
            birth_date text,
            num_siblings integer
            )""")

In [28]:
c

In [3]:
# your_info
students = {
    'first_name' : 'henry',
    'birthday' :  '07-26',
    'siblings' : 1
}

In [4]:
students

{'first_name': 'henry', 'birthday': '07-26', 'siblings': 1}

In [5]:
# insert entries into this db 
c.execute("INSERT INTO students VALUES ('something', '09-07',2)")

# This method sends a COMMIT statement to the MySQL server, committing the current transaction.
#Since by default Connector/Python does not autocommit, it is important to call this method after every 
# transaction that modifies data for tables that use transactional storage engines.
conn.commit()

# closing the cursor
c.close()

# closing the connection
conn.close()

In [ ]:
# once you have closed the cursor and the connection, you cannot query from the db unless 
# you establish another connection

In [30]:
conn = sqlite3.connect('students.db')
c = conn.cursor()

In [37]:
# insert even more entries into this table
c.execute( "INSERT INTO students VALUES (?,?,?)",[students['first_name'],students['birthday'],students['siblings']])
conn.commit()

In [47]:
students['first_name']

'henry'

In [46]:
# let's see what we have in our students table

# you can either access the said db via a GUI application, or you can

c.execute("""select * from students""")
c.fetchall()

[('something', '09-07', 2), ('henry', '07-26', 1)]

In [22]:
# lets insert all of the data into db 
import json
f = open('students.json','r')
student_data = json.loads(f.read())

In [44]:
f = open('students.json','r')
f.readlines()

['[{"first_name": "Sean",\n',
 '"birthday":"02-06",\n',
 '"siblings" : 4\n',
 '},\n',
 '{"first_name": "Cole",\n',
 '"birthday": "07-20",\n',
 '"siblings" : 2\n',
 '},\n',
 '{"first_name": "Marc",\n',
 '  "birthday":"07-01",\n',
 '  "siblings" : 0\n',
 '},\n',
 '{"first_name": "Rima",\n',
 '   "birthday":"07-18",\n',
 '   "siblings" : 2\n',
 '   },\n',
 '{"first_name": "Abdul",\n',
 '  "birthday":"10-08",\n',
 '  "siblings" : 1\n',
 ' },\n',
 ' {"first_name": "Grace",\n',
 '  "birthday":"03-28",\n',
 '  "siblings" : 1\n',
 '},\n',
 '{"first_name": "Caroline",\n',
 '  "birthday":"01-05",\n',
 '  "siblings" : 3\n',
 '  },\n',
 '  {"first_name": "Kevin",\n',
 '   "birthday":"03-12",\n',
 '   "siblings" : 1\n',
 '   },\n',
 '   {"first_name": "Thom",\n',
 '   "birthday":"08-29",\n',
 '   "siblings" : 2\n',
 '   },\n',
 '   {"first_name": "Derrick",\n',
 '   "birthday":"02-23",\n',
 '   "siblings" : 0\n',
 '   },\n',
 '   {"first_name": "Thom",\n',
 '   "birthday":"08-29",\n',
 '   "siblings" : 2\n',
 '   },\n',
 '   {"first_name": "Judah",\n',
 '     "birthday":"10-23",\n',
 '     "siblings" : 0\n',
 '     }]\n']

In [23]:
student_data

[{'first_name': 'Sean', 'birthday': '02-06', 'siblings': 4},
 {'first_name': 'Cole', 'birthday': '07-20', 'siblings': 2},
 {'first_name': 'Marc', 'birthday': '07-01', 'siblings': 0},
 {'first_name': 'Rima', 'birthday': '07-18', 'siblings': 2},
 {'first_name': 'Abdul', 'birthday': '10-08', 'siblings': 1},
 {'first_name': 'Grace', 'birthday': '03-28', 'siblings': 1},
 {'first_name': 'Caroline', 'birthday': '01-05', 'siblings': 3},
 {'first_name': 'Kevin', 'birthday': '03-12', 'siblings': 1},
 {'first_name': 'Thom', 'birthday': '08-29', 'siblings': 2},
 {'first_name': 'Derrick', 'birthday': '02-23', 'siblings': 0},
 {'first_name': 'Thom', 'birthday': '08-29', 'siblings': 2},
 {'first_name': 'Judah', 'birthday': '10-23', 'siblings': 0}]

In [49]:
student_data[0]['birthday']

'02-06'

In [26]:
# insert one entry from the dictionary into the sql students table
c.execute("INSERT INTO students VALUES (?,?,?)",student_data[0]['first_name'], student_data[0]['birthday'], student_data[0]['siblings'])

ProgrammingError: Cannot operate on a closed cursor.

In [ ]:
conn.commit()

In [ ]:
c.execute("select * from students")
c.fetchall()

In [57]:
# try this yourself! insert every entry from the dictionary into 
for i in range(0, len(student_data)-1):
    c.execute("INSERT INTO students VALUES (?,?,?)",[student_data[i]['first_name'],student_data[i]['birthday'],student_data[i]['siblings']])
    conn.commit()

In [58]:
# examine whether the changes have been committed
c.execute("select * from students")
c.fetchall()

[('something', '09-07', 2),
 ('henry', '07-26', 1),
 ('henry', '07-26', 1),
 ('henry', '07-26', 1),
 ('Sean', '02-06', 4),
 ('Cole', '07-20', 2),
 ('Sean', '02-06', 4),
 ('Cole', '07-20', 2),
 ('Marc', '07-01', 0),
 ('Rima', '07-18', 2),
 ('Abdul', '10-08', 1),
 ('Grace', '03-28', 1),
 ('Caroline', '01-05', 3),
 ('Kevin', '03-12', 1),
 ('Thom', '08-29', 2),
 ('Derrick', '02-23', 0),
 ('Thom', '08-29', 2),
 ('Sean', '02-06', 4),
 ('Cole', '07-20', 2),
 ('Marc', '07-01', 0),
 ('Rima', '07-18', 2),
 ('Abdul', '10-08', 1),
 ('Grace', '03-28', 1),
 ('Caroline', '01-05', 3),
 ('Kevin', '03-12', 1),
 ('Thom', '08-29', 2),
 ('Derrick', '02-23', 0),
 ('Thom', '08-29', 2)]

In [10]:
import json
file = open("temp.txt",'r')
file.readlines()

['random text\n', 'we are going to learn reading files\n', 'blah blah blah\n']

In [12]:
with open('temp.txt','r') as file:
    line_readline = file.readline()
    print(line_readline)

random text

In [13]:
with open('temp.txt','r') as file:
    line_read = file.read()
    print(line_read)

random text
we are going to learn reading files
blah blah blah

### Selecting, querying, and filtering data

In [15]:
f = open("students_0422.json",'r')
students_0422 = json.loads(f.read())
students_0422

[{'first_name': 'MaryJo', 'birthday': '06-02', 'siblings': 4},
 {'first_name': 'Erika', 'birthday': '09-13', 'siblings': 3},
 {'first_name': 'Gordon', 'birthday': '11-08', 'siblings': 2},
 {'first_name': 'Max', 'birthday': '03-03', 'siblings': 1},
 {'first_name': 'Andrew', 'birthday': '10-31', 'siblings': 1},
 {'first_name': 'Kiryl', 'birthday': '02-19', 'siblings': 1},
 {'first_name': 'Chris', 'birthday': '12-10', 'siblings': 2},
 {'first_name': 'Noah', 'birthday': '08-13', 'siblings': 5},
 {'first_name': 'Jon', 'birthday': '03-17', 'siblings': 1},
 {'first_name': 'Rob', 'birthday': '10-03', 'siblings': 2},
 {'first_name': 'Tara', 'birthday': '01-15', 'siblings': 1},
 {'first_name': 'David', 'birthday': '10-26', 'siblings': 2},
 {'first_name': 'Mike', 'birthday': '10-27', 'siblings': 3},
 {'first_name': 'Samuel', 'birthday': '12-17', 'siblings': 1},
 {'first_name': 'B.G.', 'birthday': '02-25', 'siblings': 2},
 {'first_name': 'Tino', 'birthday': '06-03', 'siblings': 3},
 {'first_name': 'Ulku', 'birthday': '02-12', 'siblings': 9},
 {'first_name': 'Georgiy', 'birthday': '06-08', 'siblings': 1},
 {'first_name': 'Jennifer', 'birthday': '03-10', 'siblings': 4},
 {'first_name': 'LinhDan', 'birthday': '05-04', 'siblings': 1}]

In [16]:
for

{'first_name': 'MaryJo', 'birthday': '06-02', 'siblings': 4}

In [59]:
# querying 
c.execute("SELECT * FROM students s1 join students s2 WHERE s1.first_name = s2.first_name")
conn.commit()
c.fetchall()

[('something', '09-07', 2, 'something', '09-07', 2),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('henry', '07-26', 1, 'henry', '07-26', 1),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Marc', '07-01', 0, 'Marc', '07-01', 0),
 ('Marc', '07-01', 0, 'Marc', '07-01', 0),
 ('Rima', '07-18', 2, 'Rima', '07-18', 2),
 ('Rima', '07-18', 2, 'Rima', '07-18', 2),
 ('Abdul', '10-08', 1, 'Abdul', '10-08', 1),
 ('Abdul', '10-08', 1, 'Abdul', '10-08', 1),
 ('Grace', '03-28', 1, 'Grace', '03-28', 1),
 ('Grace', '03-28', 1, 'Grace', '03-28', 1),
 ('Caroline', '01-05', 3, 'Caroline', '01-05', 3),
 ('Caroline', '01-05', 3, 'Caroline', '01-05', 3),
 ('Kevin', '03-12', 1, 'Kevin', '03-12', 1),
 ('Kevin', '03-12', 1, 'Kevin', '03-12', 1),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Derrick', '02-23', 0, 'Derrick', '02-23', 0),
 ('Derrick', '02-23', 0, 'Derrick', '02-23', 0),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Sean', '02-06', 4, 'Sean', '02-06', 4),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Cole', '07-20', 2, 'Cole', '07-20', 2),
 ('Marc', '07-01', 0, 'Marc', '07-01', 0),
 ('Marc', '07-01', 0, 'Marc', '07-01', 0),
 ('Rima', '07-18', 2, 'Rima', '07-18', 2),
 ('Rima', '07-18', 2, 'Rima', '07-18', 2),
 ('Abdul', '10-08', 1, 'Abdul', '10-08', 1),
 ('Abdul', '10-08', 1, 'Abdul', '10-08', 1),
 ('Grace', '03-28', 1, 'Grace', '03-28', 1),
 ('Grace', '03-28', 1, 'Grace', '03-28', 1),
 ('Caroline', '01-05', 3, 'Caroline', '01-05', 3),
 ('Caroline', '01-05', 3, 'Caroline', '01-05', 3),
 ('Kevin', '03-12', 1, 'Kevin', '03-12', 1),
 ('Kevin', '03-12', 1, 'Kevin', '03-12', 1),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Derrick', '02-23', 0, 'Derrick', '02-23', 0),
 ('Derrick', '02-23', 0, 'Derrick', '02-23', 0),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2),
 ('Thom', '08-29', 2, 'Thom', '08-29', 2)]

In [63]:
# querying and filtering 
c.execute("SELECT * FROM students where first_name = 'Grace'")
conn.commit()
c.fetchall()

[('Grace', '03-28', 1), ('Grace', '03-28', 1)]

In [64]:
# more querying
c.execute("SELECT * FROM students WHERE first_name != 'Kevin'")
conn.commit()
c.fetchall()

[('something', '09-07', 2),
 ('henry', '07-26', 1),
 ('henry', '07-26', 1),
 ('henry', '07-26', 1),
 ('Sean', '02-06', 4),
 ('Cole', '07-20', 2),
 ('Sean', '02-06', 4),
 ('Cole', '07-20', 2),
 ('Marc', '07-01', 0),
 ('Rima', '07-18', 2),
 ('Abdul', '10-08', 1),
 ('Grace', '03-28', 1),
 ('Caroline', '01-05', 3),
 ('Thom', '08-29', 2),
 ('Derrick', '02-23', 0),
 ('Thom', '08-29', 2),
 ('Sean', '02-06', 4),
 ('Cole', '07-20', 2),
 ('Marc', '07-01', 0),
 ('Rima', '07-18', 2),
 ('Abdul', '10-08', 1),
 ('Grace', '03-28', 1),
 ('Caroline', '01-05', 3),
 ('Thom', '08-29', 2),
 ('Derrick', '02-23', 0),
 ('Thom', '08-29', 2)]

In [ ]:
c.fetchall()

In [ ]:
# ordering 
c.execute("SELECT * FROM students order by first_name")
c.fetchall()

In [ ]:
# simple operations 
c.execute("SELECT Count (*) FROM students")
c.fetchall()

In [ ]:
# filtering and limiting

# select the people who are only child
c.execute("select * from students where num_siblings < 1")
conn.commit()
c.fetchall()

In [66]:
# want three people who has siblings 
c.execute("select * from students where num_siblings > 0 limit 3")
conn.commit()
c.fetchall()

[('something', '09-07', 2), ('henry', '07-26', 1), ('henry', '07-26', 1)]

In [65]:
# only selecting certain columns
c.execute("select first_name from students where num_siblings > 2 ")
conn.commit()
c.fetchall()

[('Sean',), ('Sean',), ('Caroline',), ('Sean',), ('Caroline',)]

## Joining and working with multiple tables 
- Like pandas df, sql allows us to work with multiple dataframes with ease with different types of JOINS
- What are they?

## Part III. Communicating and Comparison with Pandas

In [ ]:
import pandas as pd
df = pd.read_sql_query("select * from students", conn)

In [ ]:
df.head()

In [ ]:
# remember how we save this to a csv?
df.to_csv("students.csv")